export default [
  {
    time: '2021-02-01',
    theme: 'think',
    title: '为什么要坚持写博客',
    tag: '学习',
    desc: '从18年开始就有写博客的意识了，但是确很难坚持去写，自己总会拿种种原因逃避写博客，去年因为项目太忙就停止了，直到最近读了《软技能2》才意识到写博客的重要性。'
  },
  {
    time: '2021-01-22',
    theme: 'code',
    title: '初探AST，实现项目包优化',
    tag: 'AST',
    linkUrl: '//www.baidu.com',
    desc: '哈哈哈哈哈哈哈'
  },
  {
    time: '2020-12-18',
    theme: 'think',
    title: '项目上线后的总结感悟',
    tag: '项目',
    desc: '给Volvo主机厂商做的项目终于上线了，长达十个月之久的攻坚战到此落下帷幕，从项目中总结出一些经验方便日后参考与回顾。',
  },
  {
    time: '2020-11-18',
    theme: 'code',
    title: '微信小程序实践总结',
    tag: '小程序开发',
    desc: '一直想找机会想做微信小程序的项目，今年终于如愿以偿，耗时十个月，带领团队给volvo主机厂商做了个功能非常复杂的C端小程序，借这篇文章总结下开发小程序坑点以及对应的解决方案',
    linkUrl: 'https://www.yuque.com/fecyrm/uyzotu/dwxdt8'
  },
  {
    time: '2020-08-31',
    theme: 'think',
    title: '首次担任团队Leader的感受',
    tag: '前端',
    desc: '哈哈哈哈哈哈哈',
    linkUrl: '//www.baidu.com'
  },
  {
    time: '2020-03-21',
    theme: 'think',
    title: '首次接触交付型项目',
    tag: '项目',
    desc: '哈哈哈哈哈哈哈',
    linkUrl: '//www.baidu.com'
  },
  {
    time: '2020-01-28',
    theme: 'think',
    title: '沉迷于全面战争三国',
    tag: '游戏',
    desc: '哈哈哈哈哈哈哈',
    linkUrl: '//www.baidu.com'
  },
  {
    time: '2019-11-01',
    theme: 'note',
    title: '《穷爸爸，富爸爸》读后感',
    tag: '读书',
    desc: '哈哈哈哈哈哈哈',
    linkUrl: '//www.baidu.com'
  },
  {
    time: '2019-09-22',
    theme: 'think',
    title: '下定决心，要做好理财',
    tag: '生活',
    desc: '哈哈哈哈哈哈哈',
    linkUrl: '//www.baidu.com'
  },
  {
    time: '2019-06-22',
    theme: 'think',
    title: '入职大搜车一个月后的感受',
    tag: '移动端',
    desc: '哈哈哈哈哈哈哈',
    linkUrl: '//www.baidu.com'
  },
  {
    time: '2019-06-12',
    theme: 'code',
    title: '优雅地进行移动端适配',
    tag: '移动端',
    desc: '众所周知，进行移动端响应式开发，无非就是用 vw 和 rem 作为像素单位进行样式布局, 现在比较流行的是 vw 和 vh，自动根据浏览器的屏幕宽度和高度进行适配，不用像 rem 需要手动设置html的fontSize。请认真看下去，好戏再最后头😎',
    linkUrl: 'https://www.yuque.com/fecyrm/uyzotu/xkqnsn'
  },
  {
    time: '2019-04-21',
    theme: 'think',
    title: '是什么让我下定决心想要离职',
    tag: '工作',
    linkUrl: '//www.baidu.com'
  },
  {
    time: '2019-02-12',
    theme: 'note',
    title: '《睡眠革命》读后感',
    tag: '读书',
    linkUrl: '//www.baidu.com'
  },
  {
    time: '2019-01-23',
    theme: 'think',
    title: '切忌频繁换部门',
    tag: '工作',
    linkUrl: '//www.baidu.com'
  },
  {
    time: '2018-08-23',
    theme: 'think',
    title: '学习钢琴半年后的感悟',
    tag: '生活',
    linkUrl: '//www.baidu.com'
  },
  {
    time: '2018-06-12',
    theme: 'code',
    title: '如何用node写一个自动化发布工具',
    tag: 'node',
    linkUrl: '//www.baidu.com'
  },
  {
    time: '2018-04-16',
    theme: 'think',
    title: 'idea 远远大于能力',
    tag: '生活',
    linkUrl: '//www.baidu.com'
  },
  {
    time: '2018-02-21',
    theme: 'think',
    title: '下定决心，要学习钢琴',
    tag: '生活',
    linkUrl: '//www.baidu.com'
  }
]
